Revit 2027 API
BuiltInFailures.ConnectorFailures.FittingMustBeOnPipeWarn Property
 The [Tap] must be attached to pipe.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FittingMustBeOnPipeWarn { get; }
Public Shared ReadOnly Property FittingMustBeOnPipeWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FittingMustBeOnPipeWarn {
	FailureDefinitionId^ get ();
}
static member FittingMustBeOnPipeWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ConnectorFailures Class
Autodesk.Revit.DB Namespace